app/Controllers/Erp/MRPController.php

UPDATE `planning` SET `status` = 2
WHERE `planning`.`planning_id` IN ('1')
---
    public function planning_update_status($planning_id)
    {
        $exist_planning_stock = $this->PlanningModel->getStock($planning_id);

        $total_completed_bom_stock = $this->BomModel->get_completed_bom_stock($planning_id);

        // $this->logger->info($exist_planning_stock);
        // $this->logger->info($total_completed_bom_stock);
        $result = true;
        if ($total_completed_bom_stock >= $exist_planning_stock["stock"]) {
            $this->logger->info($total_completed_bom_stock >= $exist_planning_stock);
            if ($this->PlanningModel->update($planning_id, ["status" => 2])) {