app/Models/Erp/MRP/BOMModel.php

SELECT *
FROM `bom`
WHERE `related_id` = '1'
AND `status` = 2
---
    public function get_completed_bom_stock($planning_id)
    {
        $result = $this->builder()->where("related_id", $planning_id)->where("status", 2)->get()->getResultArray();

SELECT `id`, `product_type`, `item_id`, `bom_id`
FROM `bom_items`
WHERE `item_id` = '1'
AND `bom_id` = '45'
AND `product_type` = 'semifinished'
---
    public function is_existitems($product_id, $bom_id, $type)
    {
        $result = $this->BOMItemsModel->select("id,product_type,item_id,bom_id")->where("item_id", $product_id)->where("bom_id", $bom_id)->where("product_type", $type)->get()->getRowArray();

SELECT `id`, `product_type`, `item_id`, `bom_id`
FROM `bom_scrap_items`
WHERE `item_id` = '43'
AND `bom_id` = '45'
AND `product_type` = 'rawmaterial'
---
    public function is_scrap_existitems($product_id, $bom_id, $type)
    {
        $result = $this->BomscrapitemsModel->select("id,product_type,item_id,bom_id")->where("item_id", $product_id)->where("bom_id", $bom_id)->where("product_type", $type)->get()->getRowArray();

INSERT INTO `bom_items` (`product_type`, `item_id`, `quantity`, `unit_price`, `bom_id`, `amount`, `created_at`, `updated_at`) VALUES ('rawmaterial', '45', '10', '10', '45', '100.00', '2024-12-15 15:23:08', '2024-12-15 15:23:08')
---
                            "amount" => $key["amount"],
                        ];
                        $this->logger->info($d);
                        $ins = $this->BOMItemsModel->insert($d);

UPDATE `bom_items` SET `quantity` = '2', `unit_price` = '12', `amount` = '24', `updated_at` = '2024-12-15 15:23:08'
WHERE `bom_items`.`id` IN ('78')
---
                            "amount" => $key["amount"],
                        ];

                        $upd = $this->BOMItemsModel->update($res["id"], $d);

SELECT *
FROM `bom_items`
WHERE `bom_id` = '45'
---
                }


                $get_old_items = $this->BOMItemsModel->where("bom_id", $bom_id)->get()->getResultArray();

UPDATE `bom_scrap_items` SET `quantity` = '2', `unit_price` = '12', `amount` = '24', `updated_at` = '2024-12-15 15:23:08'
WHERE `bom_scrap_items`.`id` IN ('12')
---
                                "amount" => $key["amount"],
                            ];

                            $upd1 = $this->BomscrapitemsModel->update($res1["id"], $d_scrap);

SELECT *
FROM `bom_scrap_items`
WHERE `bom_id` = '45'
---
                        }
                    }

                    $get_old_items1 = $this->BomscrapitemsModel->where("bom_id", $bom_id)->get()->getResultArray();

SELECT `bom`.*, `warehouses`.`name` as `w_name`, `warehouses`.`warehouse_id` as `w_id`
FROM `bom`
JOIN `warehouses` ON `bom`.`warehouse_id` = `warehouses`.`warehouse_id`
WHERE `related_id` = '1'
AND `bom_id` = '44'
---
    public function get_exist_bom($bom_id, $planning_id)
    {

        return $this->db->table('bom')->select('bom.*, warehouses.name as w_name, warehouses.warehouse_id as w_id')->join('warehouses', 'bom.warehouse_id = warehouses.warehouse_id')->where("related_id", $planning_id)->where("bom_id", $bom_id)->get()->getRowArray();